
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТестЗапрос = Новый Запрос;
	ТестЗапрос.Текст = "ВЫБРАТЬ
						|	Товары.Ссылка КАК Номенклатура
						|ИЗ
						|	Справочник.Номенклатура КАК Товары";
	
	ОбъектЗапрос.СхемаЗапроса(ТестЗапрос)
		.Пакет(0).Выборка(0)
		.Разрешенные()
		.ДобавитьЛевоеСоединение("Товары", "РегистрНакопления.Закупки.Обороты", "Закупки", "Закупки.Номенклатура = Товары.Ссылка")
		.УстановитьПараметрыОбороты("&Начало", "&Окончание", "Месяц")
			.ДобавитьПоле("Закупки.Период", "Период")
			.ДобавитьПоле("ЕСТЬNULL(Закупки.СуммаОборот, 0)", "СуммаЗакупок")
			.ДобавитьПоле("0", "СуммаПродаж")
			.Поместить("ТаблицаОбороты")
			.ДобавитьГде("НЕ Товары.ЭтоГруппа")
			
		.ДобавитьОбъединение("Справочник.Номенклатура", "Товары")
			.Различные().Первые(100)                                        
		.ДобавитьЛевоеСоединение("Товары", "РегистрНакопления.Продажи.Обороты", "Продажи", "Продажи.Номенклатура = Товары.Ссылка")
		.УстановитьПараметрыОбороты("&Начало", "&Окончание", "Месяц")  
			.ДобавитьПоле("Товары.Ссылка", "Номенклатура") // Объединяется по псевдониму
			.ДобавитьПоле("Продажи.Период", "Период")
			.ДобавитьПоле("0", "СуммаЗакупок")
			.ДобавитьПоле("ЕСТЬNULL(Продажи.СуммаОборот, 0)", "СуммаПродаж")
			.ДобавитьГде("НЕ Товары.ЭтоГруппа")
		    .Индекс("Номенклатура, Период")          
			
		.ДобавитьПакет("ТаблицаОбороты", "ТаблицаОбороты")
			.ДобавитьПоле("ТаблицаОбороты.Номенклатура", "Номенклатура")
			.ДобавитьПоле("ТаблицаОбороты.Период", 		 "Период")
			.ДобавитьПоле("СУММА(ТаблицаОбороты.СуммаЗакупок)", "СуммаЗакупок")
			.ДобавитьПоле("СУММА(ТаблицаОбороты.СуммаПродаж)", "СуммаПродаж")
			.Группировка("ТаблицаОбороты.Номенклатура, ТаблицаОбороты.Период")
			.ДобавитьГде("СУММА(ТаблицаОбороты.СуммаЗакупок) > 0") // Говорят схема запроса сама определит раздел "ИМЕЮЩИЕ"? 
			.Порядок("Номенклатура, Период")
			.ИтогиОбщие()
			.ИтогиПо("2, 3")
			.ИтогТолькоИерархия("Номенклатура")
		.Уничтожить("ТаблицаОбороты")
	.Завершить();  
	Сообщить(ТестЗапрос.Текст);
КонецПроцедуры
